{
  "charVocab": {
    "<PAD>": 0,
    "<UNK>": 1,
    "!": 2,
    "\"": 3,
    "#": 4,
    "$": 5,
    "&": 6,
    "'": 7,
    "(": 8,
    ")": 9,
    "*": 10,
    "+": 11,
    ",": 12,
    "-": 13,
    ".": 14,
    "/": 15,
    "0": 16,
    "1": 17,
    "2": 18,
    "3": 19,
    "4": 20,
    "5": 21,
    "6": 22,
    "7": 23,
    "8": 24,
    "9": 25,
    ":": 26,
    ";": 27,
    ">": 28,
    "@": 29,
    "A": 30,
    "B": 31,
    "C": 32,
    "D": 33,
    "E": 34,
    "F": 35,
    "G": 36,
    "H": 37,
    "I": 38,
    "J": 39,
    "K": 40,
    "L": 41,
    "M": 42,
    "N": 43,
    "O": 44,
    "P": 45,
    "Q": 46,
    "R": 47,
    "S": 48,
    "T": 49,
    "U": 50,
    "V": 51,
    "W": 52,
    "X": 53,
    "Y": 54,
    "Z": 55,
    "[": 56,
    "\\": 57,
    "]": 58,
    "^": 59,
    "a": 60,
    "b": 61,
    "c": 62,
    "d": 63,
    "e": 64,
    "f": 65,
    "g": 66,
    "h": 67,
    "i": 68,
    "j": 69,
    "k": 70,
    "l": 71,
    "m": 72,
    "n": 73,
    "o": 74,
    "p": 75,
    "q": 76,
    "r": 77,
    "s": 78,
    "t": 79,
    "u": 80,
    "v": 81,
    "w": 82,
    "x": 83,
    "y": 84,
    "z": 85,
    "~": 86,
    "": 87,
    "": 88,
    "": 89,
    "£": 90,
    "¤": 91,
    "§": 92,
    "¨": 93,
    "ª": 94,
    "³": 95,
    "´": 96,
    "¶": 97,
    "¸": 98,
    "»": 99,
    "Â": 100,
    "Ã": 101,
    "Å": 102,
    "È": 103,
    "É": 104,
    "Ì": 105,
    "Õ": 106,
    "Ö": 107,
    "Ü": 108,
    "ß": 109,
    "à": 110,
    "á": 111,
    "â": 112,
    "ã": 113,
    "ä": 114,
    "å": 115,
    "ç": 116,
    "è": 117,
    "é": 118,
    "ê": 119,
    "ì": 120,
    "í": 121,
    "î": 122,
    "ï": 123,
    "ñ": 124,
    "ò": 125,
    "ó": 126,
    "ô": 127,
    "ö": 128,
    "ø": 129,
    "û": 130,
    "ü": 131,
    "č": 132,
    "ę": 133,
    "ı": 134,
    "Ł": 135,
    "ł": 136,
    "ń": 137,
    "Ř": 138,
    "Š": 139,
    "š": 140,
    "ź": 141,
    "ż": 142,
    "ž": 143,
    "ʈ": 144,
    "ˆ": 145,
    "˘": 146,
    "˛": 147,
    "–": 148,
    "’": 149,
    "†": 150,
    "‡": 151,
    "⊥": 152,
    "␤": 153,
    "－": 154
  },
  "tagVocab": {
    "<PAD>": 0,
    "B-<addrLine>": 1,
    "B-<country>": 2,
    "B-<department>": 3,
    "B-<institution>": 4,
    "B-<laboratory>": 5,
    "B-<marker>": 6,
    "B-<postBox>": 7,
    "B-<postCode>": 8,
    "B-<region>": 9,
    "B-<settlement>": 10,
    "I-<addrLine>": 11,
    "I-<country>": 12,
    "I-<department>": 13,
    "I-<institution>": 14,
    "I-<laboratory>": 15,
    "I-<marker>": 16,
    "I-<postBox>": 17,
    "I-<postCode>": 18,
    "I-<region>": 19,
    "I-<settlement>": 20,
    "O": 21
  },
  "tagIndex": {
    "0": "<PAD>",
    "1": "B-<addrLine>",
    "2": "B-<country>",
    "3": "B-<department>",
    "4": "B-<institution>",
    "5": "B-<laboratory>",
    "6": "B-<marker>",
    "7": "B-<postBox>",
    "8": "B-<postCode>",
    "9": "B-<region>",
    "10": "B-<settlement>",
    "11": "I-<addrLine>",
    "12": "I-<country>",
    "13": "I-<department>",
    "14": "I-<institution>",
    "15": "I-<laboratory>",
    "16": "I-<marker>",
    "17": "I-<postBox>",
    "18": "I-<postCode>",
    "19": "I-<region>",
    "20": "I-<settlement>",
    "21": "O"
  },
  "maxCharLength": 30,
  "featuresIndices": [
    9,
    10,
    11,
    12,
    13,
    14,
    15,
    16,
    17,
    18
  ],
  "featuresVocabularySize": 12,
  "featuresMapToIndex": {
    "9": {
      "LINEEND": 1,
      "LINEIN": 2,
      "LINESTART": 3
    },
    "10": {
      "ALLCAPS": 13,
      "INITCAP": 14,
      "NOCAPS": 15
    },
    "11": {
      "ALLDIGIT": 25,
      "CONTAINDIGIT": 26,
      "NODIGIT": 27
    },
    "12": {
      "0": 37,
      "1": 38
    },
    "13": {
      "0": 49,
      "1": 50
    },
    "14": {
      "0": 61,
      "1": 62
    },
    "15": {
      "0": 73
    },
    "16": {
      "0": 85,
      "1": 86
    },
    "17": {
      "0": 97,
      "1": 98
    },
    "18": {
      "COMMA": 109,
      "DOT": 110,
      "ENDBRACKET": 111,
      "HYPHEN": 112,
      "NOPUNCT": 113,
      "OPENBRACKET": 114,
      "PUNCT": 115,
      "QUOTE": 116
    }
  }
}