{
  "charVocab": {
    "<PAD>": 0,
    "<UNK>": 1,
    "!": 2,
    "\"": 3,
    "#": 4,
    "$": 5,
    "%": 6,
    "&": 7,
    "'": 8,
    "(": 9,
    ")": 10,
    "*": 11,
    "+": 12,
    ",": 13,
    "-": 14,
    ".": 15,
    "/": 16,
    "0": 17,
    "1": 18,
    "2": 19,
    "3": 20,
    "4": 21,
    "5": 22,
    "6": 23,
    "7": 24,
    "8": 25,
    "9": 26,
    ":": 27,
    ";": 28,
    "<": 29,
    "=": 30,
    ">": 31,
    "?": 32,
    "@": 33,
    "A": 34,
    "B": 35,
    "C": 36,
    "D": 37,
    "E": 38,
    "F": 39,
    "G": 40,
    "H": 41,
    "I": 42,
    "J": 43,
    "K": 44,
    "L": 45,
    "M": 46,
    "N": 47,
    "O": 48,
    "P": 49,
    "Q": 50,
    "R": 51,
    "S": 52,
    "T": 53,
    "U": 54,
    "V": 55,
    "W": 56,
    "X": 57,
    "Y": 58,
    "Z": 59,
    "[": 60,
    "\\": 61,
    "]": 62,
    "^": 63,
    "_": 64,
    "`": 65,
    "a": 66,
    "b": 67,
    "c": 68,
    "d": 69,
    "e": 70,
    "f": 71,
    "g": 72,
    "h": 73,
    "i": 74,
    "j": 75,
    "k": 76,
    "l": 77,
    "m": 78,
    "n": 79,
    "o": 80,
    "p": 81,
    "q": 82,
    "r": 83,
    "s": 84,
    "t": 85,
    "u": 86,
    "v": 87,
    "w": 88,
    "x": 89,
    "y": 90,
    "z": 91,
    "|": 92,
    "~": 93,
    "": 94,
    "": 95,
    "": 96,
    "": 97,
    "¡": 98,
    "¢": 99,
    "¤": 100,
    "§": 101,
    "¨": 102,
    "©": 103,
    "«": 104,
    "­": 105,
    "¯": 106,
    "°": 107,
    "±": 108,
    "²": 109,
    "³": 110,
    "´": 111,
    "µ": 112,
    "¸": 113,
    "º": 114,
    "»": 115,
    "¼": 116,
    "¿": 117,
    "À": 118,
    "Á": 119,
    "Â": 120,
    "Ã": 121,
    "Å": 122,
    "È": 123,
    "É": 124,
    "Ê": 125,
    "Î": 126,
    "Ï": 127,
    "Ô": 128,
    "Ö": 129,
    "×": 130,
    "Ø": 131,
    "Ü": 132,
    "ß": 133,
    "à": 134,
    "á": 135,
    "â": 136,
    "ã": 137,
    "ä": 138,
    "ç": 139,
    "è": 140,
    "é": 141,
    "ê": 142,
    "ì": 143,
    "í": 144,
    "î": 145,
    "ï": 146,
    "ñ": 147,
    "ò": 148,
    "ó": 149,
    "ô": 150,
    "õ": 151,
    "ö": 152,
    "ø": 153,
    "ú": 154,
    "û": 155,
    "ü": 156,
    "ý": 157,
    "Ă": 158,
    "ą": 159,
    "ć": 160,
    "Č": 161,
    "č": 162,
    "ė": 163,
    "ę": 164,
    "ğ": 165,
    "İ": 166,
    "ı": 167,
    "Ĳ": 168,
    "ľ": 169,
    "ł": 170,
    "ń": 171,
    "ř": 172,
    "ś": 173,
    "š": 174,
    "ū": 175,
    "Ź": 176,
    "Ž": 177,
    "ž": 178,
    "ˆ": 179,
    "ˇ": 180,
    "˜": 181,
    "́": 182,
    "Κ": 183,
    "Λ": 184,
    "Ξ": 185,
    "Π": 186,
    "α": 187,
    "β": 188,
    "γ": 189,
    "ε": 190,
    "η": 191,
    "θ": 192,
    "ι": 193,
    "λ": 194,
    "ν": 195,
    "ξ": 196,
    "ο": 197,
    "π": 198,
    "ρ": 199,
    "ς": 200,
    "σ": 201,
    "τ": 202,
    "φ": 203,
    "ϩ": 204,
    "А": 205,
    "Б": 206,
    "В": 207,
    "Д": 208,
    "Е": 209,
    "И": 210,
    "К": 211,
    "Л": 212,
    "М": 213,
    "Н": 214,
    "О": 215,
    "П": 216,
    "Р": 217,
    "С": 218,
    "Т": 219,
    "Х": 220,
    "Ч": 221,
    "Я": 222,
    "а": 223,
    "б": 224,
    "в": 225,
    "г": 226,
    "д": 227,
    "е": 228,
    "ж": 229,
    "з": 230,
    "и": 231,
    "й": 232,
    "к": 233,
    "л": 234,
    "м": 235,
    "н": 236,
    "о": 237,
    "п": 238,
    "р": 239,
    "с": 240,
    "т": 241,
    "у": 242,
    "ф": 243,
    "х": 244,
    "ц": 245,
    "ч": 246,
    "щ": 247,
    "ъ": 248,
    "ы": 249,
    "ь": 250,
    "э": 251,
    "ю": 252,
    "я": 253,
    "᎐": 254,
    "ἄ": 255,
    "ἔ": 256,
    "έ": 257,
    "ό": 258,
    "‘": 259,
    "’": 260,
    "‚": 261,
    "“": 262,
    "”": 263,
    "„": 264,
    "•": 265,
    "․": 266,
    "…": 267,
    "ℓ": 268,
    "→": 269,
    "↵": 270,
    "∂": 271,
    "∆": 272,
    "√": 273,
    "∝": 274,
    "∞": 275,
    "∼": 276,
    "≅": 277,
    "、": 278,
    "あ": 279,
    "い": 280,
    "え": 281,
    "お": 282,
    "か": 283,
    "ぐ": 284,
    "け": 285,
    "げ": 286,
    "こ": 287,
    "さ": 288,
    "し": 289,
    "す": 290,
    "た": 291,
    "ち": 292,
    "っ": 293,
    "つ": 294,
    "づ": 295,
    "て": 296,
    "で": 297,
    "と": 298,
    "な": 299,
    "に": 300,
    "の": 301,
    "び": 302,
    "ま": 303,
    "み": 304,
    "む": 305,
    "め": 306,
    "ゆ": 307,
    "よ": 308,
    "ら": 309,
    "り": 310,
    "る": 311,
    "れ": 312,
    "わ": 313,
    "を": 314,
    "ァ": 315,
    "ア": 316,
    "ィ": 317,
    "イ": 318,
    "ウ": 319,
    "ェ": 320,
    "エ": 321,
    "カ": 322,
    "ガ": 323,
    "キ": 324,
    "ク": 325,
    "グ": 326,
    "コ": 327,
    "ゴ": 328,
    "シ": 329,
    "ジ": 330,
    "ス": 331,
    "ズ": 332,
    "セ": 333,
    "ソ": 334,
    "タ": 335,
    "チ": 336,
    "ッ": 337,
    "テ": 338,
    "デ": 339,
    "ト": 340,
    "ド": 341,
    "ナ": 342,
    "ニ": 343,
    "ネ": 344,
    "ノ": 345,
    "ハ": 346,
    "バ": 347,
    "パ": 348,
    "ヒ": 349,
    "フ": 350,
    "ブ": 351,
    "プ": 352,
    "ベ": 353,
    "ミ": 354,
    "ム": 355,
    "メ": 356,
    "モ": 357,
    "ュ": 358,
    "ョ": 359,
    "ラ": 360,
    "リ": 361,
    "ル": 362,
    "レ": 363,
    "ロ": 364,
    "ワ": 365,
    "ン": 366,
    "・": 367,
    "ー": 368,
    "一": 369,
    "丁": 370,
    "三": 371,
    "上": 372,
    "下": 373,
    "与": 374,
    "世": 375,
    "丘": 376,
    "业": 377,
    "东": 378,
    "个": 379,
    "中": 380,
    "临": 381,
    "为": 382,
    "主": 383,
    "丽": 384,
    "久": 385,
    "之": 386,
    "乐": 387,
    "也": 388,
    "习": 389,
    "书": 390,
    "乾": 391,
    "予": 392,
    "事": 393,
    "二": 394,
    "于": 395,
    "云": 396,
    "互": 397,
    "五": 398,
    "井": 399,
    "亞": 400,
    "交": 401,
    "亥": 402,
    "产": 403,
    "京": 404,
    "亮": 405,
    "人": 406,
    "仁": 407,
    "今": 408,
    "介": 409,
    "从": 410,
    "仙": 411,
    "代": 412,
    "以": 413,
    "仲": 414,
    "价": 415,
    "任": 416,
    "仿": 417,
    "企": 418,
    "伊": 419,
    "伍": 420,
    "众": 421,
    "会": 422,
    "伟": 423,
    "传": 424,
    "伯": 425,
    "伸": 426,
    "伽": 427,
    "但": 428,
    "位": 429,
    "住": 430,
    "体": 431,
    "何": 432,
    "作": 433,
    "佳": 434,
    "併": 435,
    "使": 436,
    "來": 437,
    "例": 438,
    "供": 439,
    "価": 440,
    "便": 441,
    "係": 442,
    "俄": 443,
    "俊": 444,
    "保": 445,
    "信": 446,
    "修": 447,
    "倉": 448,
    "倩": 449,
    "倪": 450,
    "倫": 451,
    "倻": 452,
    "值": 453,
    "偉": 454,
    "偿": 455,
    "傳": 456,
    "傷": 457,
    "傾": 458,
    "元": 459,
    "兆": 460,
    "光": 461,
    "克": 462,
    "入": 463,
    "內": 464,
    "全": 465,
    "八": 466,
    "公": 467,
    "六": 468,
    "共": 469,
    "关": 470,
    "兵": 471,
    "其": 472,
    "典": 473,
    "兼": 474,
    "内": 475,
    "再": 476,
    "冠": 477,
    "冬": 478,
    "几": 479,
    "処": 480,
    "出": 481,
    "分": 482,
    "刊": 483,
    "划": 484,
    "刘": 485,
    "刚": 486,
    "创": 487,
    "初": 488,
    "判": 489,
    "利": 490,
    "到": 491,
    "制": 492,
    "券": 493,
    "刻": 494,
    "前": 495,
    "剛": 496,
    "剧": 497,
    "創": 498,
    "劉": 499,
    "功": 500,
    "加": 501,
    "动": 502,
    "勉": 503,
    "動": 504,
    "務": 505,
    "勝": 506,
    "勵": 507,
    "化": 508,
    "北": 509,
    "匱": 510,
    "区": 511,
    "医": 512,
    "區": 513,
    "十": 514,
    "千": 515,
    "半": 516,
    "华": 517,
    "卓": 518,
    "協": 519,
    "南": 520,
    "占": 521,
    "卫": 522,
    "危": 523,
    "卷": 524,
    "厅": 525,
    "原": 526,
    "去": 527,
    "参": 528,
    "參": 529,
    "叉": 530,
    "及": 531,
    "发": 532,
    "取": 533,
    "受": 534,
    "变": 535,
    "叢": 536,
    "口": 537,
    "古": 538,
    "句": 539,
    "可": 540,
    "史": 541,
    "号": 542,
    "司": 543,
    "合": 544,
    "吉": 545,
    "同": 546,
    "名": 547,
    "后": 548,
    "向": 549,
    "听": 550,
    "启": 551,
    "吳": 552,
    "吴": 553,
    "吾": 554,
    "呈": 555,
    "告": 556,
    "周": 557,
    "和": 558,
    "品": 559,
    "哉": 560,
    "响": 561,
    "員": 562,
    "哲": 563,
    "商": 564,
    "問": 565,
    "啸": 566,
    "善": 567,
    "喜": 568,
    "喪": 569,
    "喬": 570,
    "営": 571,
    "嘉": 572,
    "器": 573,
    "四": 574,
    "回": 575,
    "因": 576,
    "図": 577,
    "围": 578,
    "国": 579,
    "图": 580,
    "國": 581,
    "園": 582,
    "圖": 583,
    "土": 584,
    "在": 585,
    "地": 586,
    "场": 587,
    "址": 588,
    "坂": 589,
    "坚": 590,
    "坛": 591,
    "坤": 592,
    "型": 593,
    "城": 594,
    "域": 595,
    "培": 596,
    "基": 597,
    "堂": 598,
    "堯": 599,
    "報": 600,
    "塙": 601,
    "塚": 602,
    "塩": 603,
    "境": 604,
    "增": 605,
    "壁": 606,
    "壇": 607,
    "士": 608,
    "変": 609,
    "复": 610,
    "夏": 611,
    "外": 612,
    "多": 613,
    "大": 614,
    "天": 615,
    "太": 616,
    "夫": 617,
    "夭": 618,
    "奇": 619,
    "女": 620,
    "妍": 621,
    "始": 622,
    "委": 623,
    "姚": 624,
    "姜": 625,
    "娇": 626,
    "娟": 627,
    "婧": 628,
    "婷": 629,
    "媒": 630,
    "嬀": 631,
    "子": 632,
    "存": 633,
    "孙": 634,
    "孟": 635,
    "季": 636,
    "学": 637,
    "孫": 638,
    "學": 639,
    "宁": 640,
    "宇": 641,
    "安": 642,
    "宋": 643,
    "完": 644,
    "宏": 645,
    "宗": 646,
    "宙": 647,
    "定": 648,
    "宜": 649,
    "宝": 650,
    "实": 651,
    "実": 652,
    "害": 653,
    "家": 654,
    "容": 655,
    "宿": 656,
    "寅": 657,
    "寒": 658,
    "察": 659,
    "實": 660,
    "寧": 661,
    "寸": 662,
    "对": 663,
    "寺": 664,
    "导": 665,
    "寿": 666,
    "専": 667,
    "尊": 668,
    "對": 669,
    "小": 670,
    "少": 671,
    "尙": 672,
    "尚": 673,
    "就": 674,
    "尻": 675,
    "尽": 676,
    "尾": 677,
    "居": 678,
    "屋": 679,
    "展": 680,
    "山": 681,
    "岡": 682,
    "岭": 683,
    "岸": 684,
    "峰": 685,
    "島": 686,
    "崎": 687,
    "崗": 688,
    "嶺": 689,
    "川": 690,
    "州": 691,
    "工": 692,
    "巫": 693,
    "差": 694,
    "巻": 695,
    "市": 696,
    "师": 697,
    "師": 698,
    "常": 699,
    "帽": 700,
    "平": 701,
    "年": 702,
    "幸": 703,
    "广": 704,
    "広": 705,
    "庆": 706,
    "床": 707,
    "应": 708,
    "店": 709,
    "府": 710,
    "度": 711,
    "康": 712,
    "庸": 713,
    "庾": 714,
    "廢": 715,
    "廣": 716,
    "建": 717,
    "开": 718,
    "式": 719,
    "引": 720,
    "弘": 721,
    "张": 722,
    "弥": 723,
    "張": 724,
    "归": 725,
    "当": 726,
    "形": 727,
    "彤": 728,
    "彦": 729,
    "彬": 730,
    "彭": 731,
    "影": 732,
    "征": 733,
    "律": 734,
    "徐": 735,
    "從": 736,
    "復": 737,
    "微": 738,
    "徳": 739,
    "德": 740,
    "徽": 741,
    "心": 742,
    "忍": 743,
    "志": 744,
    "忠": 745,
    "快": 746,
    "念": 747,
    "态": 748,
    "思": 749,
    "性": 750,
    "恭": 751,
    "息": 752,
    "悖": 753,
    "悠": 754,
    "悼": 755,
    "情": 756,
    "惠": 757,
    "想": 758,
    "意": 759,
    "感": 760,
    "態": 761,
    "慧": 762,
    "慶": 763,
    "應": 764,
    "成": 765,
    "我": 766,
    "戦": 767,
    "戰": 768,
    "戶": 769,
    "戸": 770,
    "房": 771,
    "所": 772,
    "扈": 773,
    "打": 774,
    "払": 775,
    "承": 776,
    "技": 777,
    "报": 778,
    "拡": 779,
    "择": 780,
    "持": 781,
    "指": 782,
    "挑": 783,
    "捷": 784,
    "排": 785,
    "掛": 786,
    "探": 787,
    "接": 788,
    "控": 789,
    "推": 790,
    "措": 791,
    "揣": 792,
    "摇": 793,
    "撥": 794,
    "播": 795,
    "支": 796,
    "改": 797,
    "放": 798,
    "政": 799,
    "效": 800,
    "敎": 801,
    "教": 802,
    "敦": 803,
    "敬": 804,
    "数": 805,
    "文": 806,
    "斌": 807,
    "斐": 808,
    "料": 809,
    "斜": 810,
    "新": 811,
    "斷": 812,
    "方": 813,
    "於": 814,
    "施": 815,
    "族": 816,
    "日": 817,
    "时": 818,
    "昌": 819,
    "明": 820,
    "易": 821,
    "星": 822,
    "春": 823,
    "時": 824,
    "晋": 825,
    "晓": 826,
    "晨": 827,
    "景": 828,
    "晴": 829,
    "暢": 830,
    "暴": 831,
    "曉": 832,
    "更": 833,
    "書": 834,
    "曹": 835,
    "替": 836,
    "最": 837,
    "會": 838,
    "月": 839,
    "有": 840,
    "服": 841,
    "望": 842,
    "朝": 843,
    "期": 844,
    "木": 845,
    "未": 846,
    "本": 847,
    "朮": 848,
    "术": 849,
    "朱": 850,
    "机": 851,
    "杂": 852,
    "杉": 853,
    "李": 854,
    "材": 855,
    "村": 856,
    "杜": 857,
    "来": 858,
    "杨": 859,
    "杭": 860,
    "杰": 861,
    "東": 862,
    "松": 863,
    "板": 864,
    "构": 865,
    "析": 866,
    "林": 867,
    "果": 868,
    "某": 869,
    "染": 870,
    "查": 871,
    "柳": 872,
    "査": 873,
    "标": 874,
    "树": 875,
    "校": 876,
    "株": 877,
    "根": 878,
    "格": 879,
    "桂": 880,
    "案": 881,
    "梓": 882,
    "梦": 883,
    "棄": 884,
    "森": 885,
    "植": 886,
    "検": 887,
    "楊": 888,
    "楚": 889,
    "楠": 890,
    "業": 891,
    "楮": 892,
    "楼": 893,
    "概": 894,
    "榮": 895,
    "構": 896,
    "槪": 897,
    "槻": 898,
    "標": 899,
    "樟": 900,
    "模": 901,
    "樣": 902,
    "横": 903,
    "樹": 904,
    "橋": 905,
    "機": 906,
    "檢": 907,
    "欒": 908,
    "次": 909,
    "歉": 910,
    "歐": 911,
    "正": 912,
    "武": 913,
    "歴": 914,
    "歷": 915,
    "殊": 916,
    "毅": 917,
    "毒": 918,
    "比": 919,
    "氏": 920,
    "民": 921,
    "气": 922,
    "気": 923,
    "氣": 924,
    "水": 925,
    "氷": 926,
    "永": 927,
    "汚": 928,
    "江": 929,
    "池": 930,
    "污": 931,
    "汤": 932,
    "汪": 933,
    "汶": 934,
    "決": 935,
    "沈": 936,
    "沢": 937,
    "河": 938,
    "油": 939,
    "治": 940,
    "沼": 941,
    "沿": 942,
    "況": 943,
    "法": 944,
    "波": 945,
    "泰": 946,
    "洋": 947,
    "津": 948,
    "洪": 949,
    "洱": 950,
    "活": 951,
    "流": 952,
    "浅": 953,
    "测": 954,
    "济": 955,
    "浙": 956,
    "海": 957,
    "涉": 958,
    "涛": 959,
    "涵": 960,
    "淑": 961,
    "淘": 962,
    "淡": 963,
    "淵": 964,
    "混": 965,
    "淸": 966,
    "淺": 967,
    "清": 968,
    "済": 969,
    "渡": 970,
    "測": 971,
    "港": 972,
    "湖": 973,
    "湯": 974,
    "源": 975,
    "準": 976,
    "溫": 977,
    "滋": 978,
    "滙": 979,
    "滿": 980,
    "演": 981,
    "漢": 982,
    "漫": 983,
    "潘": 984,
    "澤": 985,
    "濟": 986,
    "濤": 987,
    "瀉": 988,
    "灣": 989,
    "火": 990,
    "灼": 991,
    "災": 992,
    "灾": 993,
    "炎": 994,
    "炭": 995,
    "炮": 996,
    "点": 997,
    "煌": 998,
    "照": 999,
    "熱": 1000,
    "燕": 1001,
    "爲": 1002,
    "片": 1003,
    "版": 1004,
    "牟": 1005,
    "物": 1006,
    "特": 1007,
    "状": 1008,
    "獎": 1009,
    "獨": 1010,
    "獻": 1011,
    "玄": 1012,
    "玉": 1013,
    "王": 1014,
    "环": 1015,
    "现": 1016,
    "玲": 1017,
    "珉": 1018,
    "珍": 1019,
    "現": 1020,
    "球": 1021,
    "理": 1022,
    "琛": 1023,
    "瑛": 1024,
    "瑶": 1025,
    "璐": 1026,
    "環": 1027,
    "瓷": 1028,
    "甘": 1029,
    "生": 1030,
    "産": 1031,
    "用": 1032,
    "田": 1033,
    "由": 1034,
    "甲": 1035,
    "电": 1036,
    "町": 1037,
    "画": 1038,
    "界": 1039,
    "略": 1040,
    "畫": 1041,
    "異": 1042,
    "疗": 1043,
    "疾": 1044,
    "病": 1045,
    "症": 1046,
    "瘡": 1047,
    "療": 1048,
    "発": 1049,
    "登": 1050,
    "白": 1051,
    "百": 1052,
    "的": 1053,
    "益": 1054,
    "监": 1055,
    "盘": 1056,
    "盟": 1057,
    "監": 1058,
    "盤": 1059,
    "目": 1060,
    "直": 1061,
    "相": 1062,
    "省": 1063,
    "看": 1064,
    "県": 1065,
    "眞": 1066,
    "真": 1067,
    "督": 1068,
    "瞻": 1069,
    "知": 1070,
    "石": 1071,
    "砂": 1072,
    "研": 1073,
    "硏": 1074,
    "碩": 1075,
    "礎": 1076,
    "示": 1077,
    "社": 1078,
    "祐": 1079,
    "祝": 1080,
    "神": 1081,
    "禎": 1082,
    "福": 1083,
    "秀": 1084,
    "私": 1085,
    "科": 1086,
    "秘": 1087,
    "秦": 1088,
    "程": 1089,
    "稿": 1090,
    "穎": 1091,
    "穫": 1092,
    "究": 1093,
    "空": 1094,
    "窟": 1095,
    "立": 1096,
    "章": 1097,
    "童": 1098,
    "笛": 1099,
    "第": 1100,
    "等": 1101,
    "策": 1102,
    "筧": 1103,
    "管": 1104,
    "節": 1105,
    "築": 1106,
    "篤": 1107,
    "簡": 1108,
    "籍": 1109,
    "米": 1110,
    "粘": 1111,
    "系": 1112,
    "紀": 1113,
    "紅": 1114,
    "素": 1115,
    "細": 1116,
    "組": 1117,
    "経": 1118,
    "結": 1119,
    "經": 1120,
    "綜": 1121,
    "綠": 1122,
    "総": 1123,
    "緑": 1124,
    "編": 1125,
    "縣": 1126,
    "總": 1127,
    "績": 1128,
    "繁": 1129,
    "續": 1130,
    "红": 1131,
    "纪": 1132,
    "练": 1133,
    "组": 1134,
    "经": 1135,
    "结": 1136,
    "络": 1137,
    "绩": 1138,
    "综": 1139,
    "绿": 1140,
    "网": 1141,
    "置": 1142,
    "美": 1143,
    "群": 1144,
    "義": 1145,
    "習": 1146,
    "翔": 1147,
    "翟": 1148,
    "翰": 1149,
    "考": 1150,
    "者": 1151,
    "耳": 1152,
    "联": 1153,
    "聚": 1154,
    "聪": 1155,
    "肅": 1156,
    "肖": 1157,
    "育": 1158,
    "肺": 1159,
    "背": 1160,
    "胡": 1161,
    "能": 1162,
    "脈": 1163,
    "脉": 1164,
    "腑": 1165,
    "腔": 1166,
    "臟": 1167,
    "臣": 1168,
    "臨": 1169,
    "致": 1170,
    "臺": 1171,
    "與": 1172,
    "興": 1173,
    "舒": 1174,
    "舞": 1175,
    "般": 1176,
    "船": 1177,
    "良": 1178,
    "艺": 1179,
    "节": 1180,
    "芍": 1181,
    "芝": 1182,
    "芬": 1183,
    "花": 1184,
    "芳": 1185,
    "苏": 1186,
    "苦": 1187,
    "英": 1188,
    "茂": 1189,
    "范": 1190,
    "草": 1191,
    "药": 1192,
    "莞": 1193,
    "莫": 1194,
    "莹": 1195,
    "菁": 1196,
    "華": 1197,
    "菱": 1198,
    "萍": 1199,
    "营": 1200,
    "萩": 1201,
    "萱": 1202,
    "落": 1203,
    "葉": 1204,
    "董": 1205,
    "蒙": 1206,
    "蒼": 1207,
    "蔡": 1208,
    "蔭": 1209,
    "薇": 1210,
    "薛": 1211,
    "薬": 1212,
    "藍": 1213,
    "藤": 1214,
    "藥": 1215,
    "虚": 1216,
    "虛": 1217,
    "號": 1218,
    "蚁": 1219,
    "蚂": 1220,
    "融": 1221,
    "行": 1222,
    "術": 1223,
    "街": 1224,
    "衛": 1225,
    "补": 1226,
    "袍": 1227,
    "被": 1228,
    "裁": 1229,
    "補": 1230,
    "製": 1231,
    "西": 1232,
    "要": 1233,
    "見": 1234,
    "規": 1235,
    "視": 1236,
    "覺": 1237,
    "觀": 1238,
    "观": 1239,
    "规": 1240,
    "视": 1241,
    "角": 1242,
    "解": 1243,
    "觴": 1244,
    "訂": 1245,
    "計": 1246,
    "討": 1247,
    "記": 1248,
    "訣": 1249,
    "設": 1250,
    "証": 1251,
    "評": 1252,
    "詹": 1253,
    "誌": 1254,
    "語": 1255,
    "調": 1256,
    "談": 1257,
    "論": 1258,
    "講": 1259,
    "謨": 1260,
    "證": 1261,
    "議": 1262,
    "變": 1263,
    "讨": 1264,
    "议": 1265,
    "许": 1266,
    "论": 1267,
    "设": 1268,
    "证": 1269,
    "评": 1270,
    "试": 1271,
    "课": 1272,
    "调": 1273,
    "谢": 1274,
    "谷": 1275,
    "象": 1276,
    "財": 1277,
    "賃": 1278,
    "資": 1279,
    "質": 1280,
    "财": 1281,
    "责": 1282,
    "质": 1283,
    "贺": 1284,
    "资": 1285,
    "赤": 1286,
    "赵": 1287,
    "越": 1288,
    "趙": 1289,
    "跡": 1290,
    "路": 1291,
    "践": 1292,
    "蹈": 1293,
    "軸": 1294,
    "較": 1295,
    "輝": 1296,
    "輯": 1297,
    "轉": 1298,
    "轶": 1299,
    "较": 1300,
    "辛": 1301,
    "辨": 1302,
    "農": 1303,
    "辺": 1304,
    "辽": 1305,
    "达": 1306,
    "过": 1307,
    "迎": 1308,
    "近": 1309,
    "进": 1310,
    "远": 1311,
    "述": 1312,
    "迹": 1313,
    "选": 1314,
    "通": 1315,
    "逝": 1316,
    "速": 1317,
    "造": 1318,
    "連": 1319,
    "進": 1320,
    "運": 1321,
    "道": 1322,
    "達": 1323,
    "遵": 1324,
    "選": 1325,
    "遺": 1326,
    "遼": 1327,
    "郎": 1328,
    "郑": 1329,
    "郞": 1330,
    "部": 1331,
    "郭": 1332,
    "都": 1333,
    "鄕": 1334,
    "鄧": 1335,
    "配": 1336,
    "酸": 1337,
    "醫": 1338,
    "重": 1339,
    "野": 1340,
    "金": 1341,
    "鈴": 1342,
    "鉛": 1343,
    "鉱": 1344,
    "銘": 1345,
    "錫": 1346,
    "録": 1347,
    "鍍": 1348,
    "鎭": 1349,
    "鏡": 1350,
    "鐵": 1351,
    "铁": 1352,
    "铜": 1353,
    "销": 1354,
    "锋": 1355,
    "長": 1356,
    "門": 1357,
    "開": 1358,
    "関": 1359,
    "閣": 1360,
    "閻": 1361,
    "閾": 1362,
    "關": 1363,
    "门": 1364,
    "问": 1365,
    "间": 1366,
    "闻": 1367,
    "阪": 1368,
    "防": 1369,
    "阳": 1370,
    "阴": 1371,
    "阿": 1372,
    "附": 1373,
    "际": 1374,
    "陈": 1375,
    "降": 1376,
    "院": 1377,
    "陰": 1378,
    "陳": 1379,
    "陶": 1380,
    "陽": 1381,
    "隆": 1382,
    "隐": 1383,
    "際": 1384,
    "障": 1385,
    "隨": 1386,
    "險": 1387,
    "雄": 1388,
    "雅": 1389,
    "集": 1390,
    "雑": 1391,
    "雙": 1392,
    "雜": 1393,
    "難": 1394,
    "雪": 1395,
    "雯": 1396,
    "雲": 1397,
    "雷": 1398,
    "震": 1399,
    "霖": 1400,
    "霞": 1401,
    "靑": 1402,
    "青": 1403,
    "非": 1404,
    "面": 1405,
    "革": 1406,
    "靳": 1407,
    "韓": 1408,
    "音": 1409,
    "韵": 1410,
    "頁": 1411,
    "須": 1412,
    "領": 1413,
    "題": 1414,
    "類": 1415,
    "页": 1416,
    "顾": 1417,
    "颖": 1418,
    "题": 1419,
    "颜": 1420,
    "風": 1421,
    "风": 1422,
    "飛": 1423,
    "餘": 1424,
    "館": 1425,
    "饰": 1426,
    "馆": 1427,
    "香": 1428,
    "馬": 1429,
    "馮": 1430,
    "驗": 1431,
    "马": 1432,
    "體": 1433,
    "高": 1434,
    "魁": 1435,
    "鮮": 1436,
    "鲜": 1437,
    "鳥": 1438,
    "鷲": 1439,
    "鸣": 1440,
    "鹽": 1441,
    "麗": 1442,
    "默": 1443,
    "點": 1444,
    "齊": 1445,
    "齋": 1446,
    "龍": 1447,
    "龙": 1448,
    "가": 1449,
    "각": 1450,
    "간": 1451,
    "갈": 1452,
    "감": 1453,
    "강": 1454,
    "개": 1455,
    "객": 1456,
    "갱": 1457,
    "거": 1458,
    "건": 1459,
    "검": 1460,
    "게": 1461,
    "격": 1462,
    "견": 1463,
    "결": 1464,
    "경": 1465,
    "계": 1466,
    "고": 1467,
    "곤": 1468,
    "공": 1469,
    "과": 1470,
    "곽": 1471,
    "관": 1472,
    "광": 1473,
    "괴": 1474,
    "교": 1475,
    "구": 1476,
    "국": 1477,
    "군": 1478,
    "궁": 1479,
    "권": 1480,
    "귀": 1481,
    "규": 1482,
    "균": 1483,
    "그": 1484,
    "극": 1485,
    "근": 1486,
    "글": 1487,
    "금": 1488,
    "급": 1489,
    "기": 1490,
    "길": 1491,
    "김": 1492,
    "까": 1493,
    "끼": 1494,
    "나": 1495,
    "낙": 1496,
    "난": 1497,
    "남": 1498,
    "내": 1499,
    "낸": 1500,
    "너": 1501,
    "넌": 1502,
    "널": 1503,
    "네": 1504,
    "넷": 1505,
    "녀": 1506,
    "년": 1507,
    "념": 1508,
    "녕": 1509,
    "노": 1510,
    "녹": 1511,
    "논": 1512,
    "놀": 1513,
    "농": 1514,
    "뉴": 1515,
    "는": 1516,
    "능": 1517,
    "니": 1518,
    "닝": 1519,
    "다": 1520,
    "단": 1521,
    "달": 1522,
    "담": 1523,
    "당": 1524,
    "대": 1525,
    "댄": 1526,
    "댓": 1527,
    "더": 1528,
    "덕": 1529,
    "던": 1530,
    "덤": 1531,
    "데": 1532,
    "델": 1533,
    "도": 1534,
    "독": 1535,
    "돈": 1536,
    "돌": 1537,
    "동": 1538,
    "되": 1539,
    "된": 1540,
    "두": 1541,
    "둔": 1542,
    "둘": 1543,
    "듀": 1544,
    "드": 1545,
    "득": 1546,
    "듣": 1547,
    "들": 1548,
    "등": 1549,
    "디": 1550,
    "딥": 1551,
    "따": 1552,
    "라": 1553,
    "란": 1554,
    "람": 1555,
    "래": 1556,
    "랜": 1557,
    "램": 1558,
    "략": 1559,
    "량": 1560,
    "러": 1561,
    "럼": 1562,
    "레": 1563,
    "렌": 1564,
    "려": 1565,
    "력": 1566,
    "련": 1567,
    "렬": 1568,
    "령": 1569,
    "례": 1570,
    "로": 1571,
    "록": 1572,
    "론": 1573,
    "료": 1574,
    "룡": 1575,
    "루": 1576,
    "룬": 1577,
    "류": 1578,
    "률": 1579,
    "른": 1580,
    "를": 1581,
    "리": 1582,
    "린": 1583,
    "림": 1584,
    "립": 1585,
    "링": 1586,
    "마": 1587,
    "만": 1588,
    "말": 1589,
    "망": 1590,
    "맞": 1591,
    "매": 1592,
    "머": 1593,
    "먹": 1594,
    "먼": 1595,
    "메": 1596,
    "멘": 1597,
    "면": 1598,
    "멸": 1599,
    "명": 1600,
    "몇": 1601,
    "모": 1602,
    "목": 1603,
    "몰": 1604,
    "묘": 1605,
    "무": 1606,
    "묵": 1607,
    "문": 1608,
    "물": 1609,
    "뮤": 1610,
    "미": 1611,
    "민": 1612,
    "밀": 1613,
    "및": 1614,
    "바": 1615,
    "박": 1616,
    "반": 1617,
    "발": 1618,
    "방": 1619,
    "배": 1620,
    "백": 1621,
    "버": 1622,
    "벌": 1623,
    "범": 1624,
    "법": 1625,
    "베": 1626,
    "벤": 1627,
    "벽": 1628,
    "변": 1629,
    "별": 1630,
    "병": 1631,
    "보": 1632,
    "복": 1633,
    "본": 1634,
    "봄": 1635,
    "봉": 1636,
    "부": 1637,
    "북": 1638,
    "분": 1639,
    "붕": 1640,
    "뷰": 1641,
    "브": 1642,
    "블": 1643,
    "비": 1644,
    "빅": 1645,
    "빈": 1646,
    "사": 1647,
    "산": 1648,
    "살": 1649,
    "삶": 1650,
    "삼": 1651,
    "상": 1652,
    "새": 1653,
    "색": 1654,
    "생": 1655,
    "서": 1656,
    "석": 1657,
    "선": 1658,
    "설": 1659,
    "섬": 1660,
    "섭": 1661,
    "성": 1662,
    "세": 1663,
    "셀": 1664,
    "션": 1665,
    "셜": 1666,
    "소": 1667,
    "속": 1668,
    "손": 1669,
    "송": 1670,
    "쇼": 1671,
    "수": 1672,
    "숙": 1673,
    "순": 1674,
    "술": 1675,
    "숭": 1676,
    "슈": 1677,
    "스": 1678,
    "슬": 1679,
    "습": 1680,
    "승": 1681,
    "시": 1682,
    "식": 1683,
    "신": 1684,
    "실": 1685,
    "심": 1686,
    "십": 1687,
    "싼": 1688,
    "쓰": 1689,
    "아": 1690,
    "악": 1691,
    "안": 1692,
    "않": 1693,
    "암": 1694,
    "압": 1695,
    "앙": 1696,
    "애": 1697,
    "액": 1698,
    "앱": 1699,
    "야": 1700,
    "양": 1701,
    "어": 1702,
    "언": 1703,
    "얻": 1704,
    "얼": 1705,
    "엄": 1706,
    "업": 1707,
    "에": 1708,
    "엔": 1709,
    "여": 1710,
    "역": 1711,
    "연": 1712,
    "열": 1713,
    "염": 1714,
    "엽": 1715,
    "영": 1716,
    "예": 1717,
    "오": 1718,
    "옥": 1719,
    "온": 1720,
    "올": 1721,
    "옵": 1722,
    "와": 1723,
    "완": 1724,
    "왜": 1725,
    "외": 1726,
    "요": 1727,
    "욕": 1728,
    "용": 1729,
    "우": 1730,
    "욱": 1731,
    "운": 1732,
    "울": 1733,
    "움": 1734,
    "웅": 1735,
    "워": 1736,
    "원": 1737,
    "월": 1738,
    "웨": 1739,
    "웹": 1740,
    "위": 1741,
    "유": 1742,
    "육": 1743,
    "윤": 1744,
    "율": 1745,
    "융": 1746,
    "으": 1747,
    "은": 1748,
    "을": 1749,
    "음": 1750,
    "응": 1751,
    "의": 1752,
    "이": 1753,
    "익": 1754,
    "인": 1755,
    "일": 1756,
    "임": 1757,
    "입": 1758,
    "있": 1759,
    "잉": 1760,
    "자": 1761,
    "작": 1762,
    "장": 1763,
    "재": 1764,
    "쟁": 1765,
    "저": 1766,
    "적": 1767,
    "전": 1768,
    "절": 1769,
    "점": 1770,
    "접": 1771,
    "젓": 1772,
    "정": 1773,
    "제": 1774,
    "젠": 1775,
    "조": 1776,
    "족": 1777,
    "존": 1778,
    "졸": 1779,
    "종": 1780,
    "좋": 1781,
    "죄": 1782,
    "주": 1783,
    "죽": 1784,
    "준": 1785,
    "중": 1786,
    "즈": 1787,
    "증": 1788,
    "지": 1789,
    "직": 1790,
    "진": 1791,
    "질": 1792,
    "집": 1793,
    "징": 1794,
    "짜": 1795,
    "쪽": 1796,
    "차": 1797,
    "착": 1798,
    "찬": 1799,
    "찰": 1800,
    "참": 1801,
    "창": 1802,
    "채": 1803,
    "책": 1804,
    "처": 1805,
    "척": 1806,
    "천": 1807,
    "철": 1808,
    "첩": 1809,
    "청": 1810,
    "체": 1811,
    "쳐": 1812,
    "초": 1813,
    "촉": 1814,
    "촌": 1815,
    "총": 1816,
    "최": 1817,
    "추": 1818,
    "축": 1819,
    "춘": 1820,
    "출": 1821,
    "춤": 1822,
    "충": 1823,
    "취": 1824,
    "츄": 1825,
    "츠": 1826,
    "측": 1827,
    "층": 1828,
    "치": 1829,
    "친": 1830,
    "침": 1831,
    "카": 1832,
    "캠": 1833,
    "커": 1834,
    "컴": 1835,
    "케": 1836,
    "켓": 1837,
    "코": 1838,
    "콘": 1839,
    "크": 1840,
    "클": 1841,
    "키": 1842,
    "타": 1843,
    "탄": 1844,
    "탈": 1845,
    "탐": 1846,
    "탑": 1847,
    "탕": 1848,
    "태": 1849,
    "택": 1850,
    "터": 1851,
    "털": 1852,
    "테": 1853,
    "텍": 1854,
    "텐": 1855,
    "텔": 1856,
    "템": 1857,
    "토": 1858,
    "통": 1859,
    "퇴": 1860,
    "투": 1861,
    "튜": 1862,
    "트": 1863,
    "특": 1864,
    "티": 1865,
    "팅": 1866,
    "파": 1867,
    "판": 1868,
    "패": 1869,
    "퍼": 1870,
    "페": 1871,
    "펴": 1872,
    "편": 1873,
    "평": 1874,
    "포": 1875,
    "폰": 1876,
    "표": 1877,
    "품": 1878,
    "풍": 1879,
    "퓨": 1880,
    "프": 1881,
    "플": 1882,
    "피": 1883,
    "픽": 1884,
    "하": 1885,
    "학": 1886,
    "한": 1887,
    "할": 1888,
    "함": 1889,
    "합": 1890,
    "항": 1891,
    "해": 1892,
    "행": 1893,
    "향": 1894,
    "허": 1895,
    "헌": 1896,
    "험": 1897,
    "혁": 1898,
    "현": 1899,
    "협": 1900,
    "형": 1901,
    "혜": 1902,
    "호": 1903,
    "혼": 1904,
    "홍": 1905,
    "화": 1906,
    "확": 1907,
    "환": 1908,
    "활": 1909,
    "황": 1910,
    "회": 1911,
    "획": 1912,
    "효": 1913,
    "후": 1914,
    "훈": 1915,
    "흠": 1916,
    "흡": 1917,
    "흥": 1918,
    "희": 1919,
    "": 1920,
    "": 1921,
    "金": 1922,
    "濫": 1923,
    "綠": 1924,
    "錄": 1925,
    "論": 1926,
    "菱": 1927,
    "讀": 1928,
    "了": 1929,
    "李": 1930,
    "林": 1931,
    "臨": 1932,
    "拓": 1933,
    "ﬀ": 1934,
    "ﬁ": 1935,
    "ﬂ": 1936,
    "�": 1937
  },
  "tagVocab": {
    "<PAD>": 0,
    "B-<author>": 1,
    "B-<booktitle>": 2,
    "B-<collaboration>": 3,
    "B-<date>": 4,
    "B-<editor>": 5,
    "B-<institution>": 6,
    "B-<issue>": 7,
    "B-<journal>": 8,
    "B-<location>": 9,
    "B-<note>": 10,
    "B-<pages>": 11,
    "B-<publisher>": 12,
    "B-<pubnum>": 13,
    "B-<series>": 14,
    "B-<tech>": 15,
    "B-<title>": 16,
    "B-<volume>": 17,
    "B-<web>": 18,
    "I-<author>": 19,
    "I-<booktitle>": 20,
    "I-<collaboration>": 21,
    "I-<date>": 22,
    "I-<editor>": 23,
    "I-<institution>": 24,
    "I-<issue>": 25,
    "I-<journal>": 26,
    "I-<location>": 27,
    "I-<note>": 28,
    "I-<pages>": 29,
    "I-<publisher>": 30,
    "I-<pubnum>": 31,
    "I-<series>": 32,
    "I-<tech>": 33,
    "I-<title>": 34,
    "I-<volume>": 35,
    "I-<web>": 36,
    "O": 37
  },
  "tagIndex": {
    "0": "<PAD>",
    "1": "B-<author>",
    "2": "B-<booktitle>",
    "3": "B-<collaboration>",
    "4": "B-<date>",
    "5": "B-<editor>",
    "6": "B-<institution>",
    "7": "B-<issue>",
    "8": "B-<journal>",
    "9": "B-<location>",
    "10": "B-<note>",
    "11": "B-<pages>",
    "12": "B-<publisher>",
    "13": "B-<pubnum>",
    "14": "B-<series>",
    "15": "B-<tech>",
    "16": "B-<title>",
    "17": "B-<volume>",
    "18": "B-<web>",
    "19": "I-<author>",
    "20": "I-<booktitle>",
    "21": "I-<collaboration>",
    "22": "I-<date>",
    "23": "I-<editor>",
    "24": "I-<institution>",
    "25": "I-<issue>",
    "26": "I-<journal>",
    "27": "I-<location>",
    "28": "I-<note>",
    "29": "I-<pages>",
    "30": "I-<publisher>",
    "31": "I-<pubnum>",
    "32": "I-<series>",
    "33": "I-<tech>",
    "34": "I-<title>",
    "35": "I-<volume>",
    "36": "I-<web>",
    "37": "O"
  },
  "maxCharLength": 30,
  "featuresIndices": [
    9,
    10,
    11,
    12,
    13,
    14,
    15,
    16,
    17,
    18,
    19,
    20,
    21,
    22,
    23,
    24,
    25,
    26,
    27
  ],
  "featuresVocabularySize": 12,
  "featuresMapToIndex": {
    "9": {
      "LINEEND": 1,
      "LINEIN": 2,
      "LINESTART": 3
    },
    "10": {
      "ALLCAP": 13,
      "INITCAP": 14,
      "NOCAPS": 15
    },
    "11": {
      "ALLDIGIT": 25,
      "CONTAINSDIGITS": 26,
      "NODIGIT": 27
    },
    "12": {
      "0": 37,
      "1": 38
    },
    "13": {
      "0": 49,
      "1": 50
    },
    "14": {
      "0": 61,
      "1": 62
    },
    "15": {
      "0": 73,
      "1": 74
    },
    "16": {
      "0": 85,
      "1": 86
    },
    "17": {
      "0": 97,
      "1": 98
    },
    "18": {
      "0": 109,
      "1": 110
    },
    "19": {
      "0": 121,
      "1": 122
    },
    "20": {
      "0": 133,
      "1": 134
    },
    "21": {
      "0": 145,
      "1": 146
    },
    "22": {
      "0": 157,
      "1": 158
    },
    "23": {
      "0": 169,
      "1": 170
    },
    "24": {
      "0": 181,
      "1": 182
    },
    "25": {
      "0": 193,
      "1": 194
    },
    "26": {
      "COMMA": 205,
      "DOT": 206,
      "ENDBRACKET": 207,
      "HYPHEN": 208,
      "NOPUNCT": 209,
      "OPENBRACKET": 210,
      "PUNCT": 211,
      "QUOTE": 212
    },
    "27": {
      "0": 217,
      "1": 218,
      "10": 219,
      "11": 220,
      "2": 221,
      "3": 222,
      "4": 223,
      "5": 224,
      "6": 225,
      "7": 226,
      "8": 227,
      "9": 228
    }
  }
}