{
  "charVocab": {
    "<PAD>": 0,
    "<UNK>": 1,
    "!": 2,
    "\"": 3,
    "#": 4,
    "$": 5,
    "%": 6,
    "&": 7,
    "'": 8,
    "(": 9,
    ")": 10,
    "*": 11,
    "+": 12,
    ",": 13,
    "-": 14,
    ".": 15,
    "/": 16,
    "0": 17,
    "1": 18,
    "2": 19,
    "3": 20,
    "4": 21,
    "5": 22,
    "6": 23,
    "7": 24,
    "8": 25,
    "9": 26,
    ":": 27,
    ";": 28,
    "<": 29,
    "=": 30,
    ">": 31,
    "?": 32,
    "@": 33,
    "A": 34,
    "B": 35,
    "C": 36,
    "D": 37,
    "E": 38,
    "F": 39,
    "G": 40,
    "H": 41,
    "I": 42,
    "J": 43,
    "K": 44,
    "L": 45,
    "M": 46,
    "N": 47,
    "O": 48,
    "P": 49,
    "Q": 50,
    "R": 51,
    "S": 52,
    "T": 53,
    "U": 54,
    "V": 55,
    "W": 56,
    "X": 57,
    "Y": 58,
    "Z": 59,
    "[": 60,
    "\\": 61,
    "]": 62,
    "^": 63,
    "_": 64,
    "`": 65,
    "a": 66,
    "b": 67,
    "c": 68,
    "d": 69,
    "e": 70,
    "f": 71,
    "g": 72,
    "h": 73,
    "i": 74,
    "j": 75,
    "k": 76,
    "l": 77,
    "m": 78,
    "n": 79,
    "o": 80,
    "p": 81,
    "q": 82,
    "r": 83,
    "s": 84,
    "t": 85,
    "u": 86,
    "v": 87,
    "w": 88,
    "x": 89,
    "y": 90,
    "z": 91,
    "{": 92,
    "|": 93,
    "}": 94,
    "~": 95,
    "¡": 96,
    "¢": 97,
    "£": 98,
    "¤": 99,
    "¥": 100,
    "§": 101,
    "¨": 102,
    "©": 103,
    "ª": 104,
    "«": 105,
    "®": 106,
    "¯": 107,
    "°": 108,
    "±": 109,
    "²": 110,
    "´": 111,
    "µ": 112,
    "¶": 113,
    "¸": 114,
    "»": 115,
    "¼": 116,
    "À": 117,
    "Á": 118,
    "Â": 119,
    "Ã": 120,
    "Å": 121,
    "É": 122,
    "Ê": 123,
    "Ì": 124,
    "Î": 125,
    "Ó": 126,
    "Õ": 127,
    "Ö": 128,
    "×": 129,
    "Ø": 130,
    "ß": 131,
    "à": 132,
    "á": 133,
    "â": 134,
    "ã": 135,
    "ä": 136,
    "å": 137,
    "ç": 138,
    "è": 139,
    "é": 140,
    "ê": 141,
    "ë": 142,
    "í": 143,
    "î": 144,
    "ï": 145,
    "ñ": 146,
    "ó": 147,
    "ô": 148,
    "õ": 149,
    "ö": 150,
    "ø": 151,
    "ú": 152,
    "û": 153,
    "ü": 154,
    "þ": 155,
    "ÿ": 156,
    "Ā": 157,
    "ă": 158,
    "Ą": 159,
    "ć": 160,
    "Č": 161,
    "č": 162,
    "ė": 163,
    "ę": 164,
    "İ": 165,
    "ı": 166,
    "Ł": 167,
    "ł": 168,
    "ń": 169,
    "Ō": 170,
    "ř": 171,
    "ş": 172,
    "Š": 173,
    "š": 174,
    "Ź": 175,
    "ź": 176,
    "ż": 177,
    "Ž": 178,
    "ž": 179,
    "Ȃ": 180,
    "ʈ": 181,
    "˙": 182,
    "͑": 183,
    "͒": 184,
    "͓": 185,
    "͔": 186,
    "͗": 187,
    "͘": 188,
    "Γ": 189,
    "Δ": 190,
    "Θ": 191,
    "Λ": 192,
    "Π": 193,
    "Υ": 194,
    "Ψ": 195,
    "α": 196,
    "β": 197,
    "γ": 198,
    "δ": 199,
    "ε": 200,
    "ζ": 201,
    "η": 202,
    "θ": 203,
    "κ": 204,
    "λ": 205,
    "μ": 206,
    "ν": 207,
    "ξ": 208,
    "π": 209,
    "ρ": 210,
    "σ": 211,
    "τ": 212,
    "φ": 213,
    "χ": 214,
    "ψ": 215,
    "ω": 216,
    "ϕ": 217,
    "ϩ": 218,
    "Ϫ": 219,
    "ϫ": 220,
    "ϭ": 221,
    "ϳ": 222,
    "Ͻ": 223,
    "Ͼ": 224,
    "Ј": 225,
    "Љ": 226,
    "Б": 227,
    "И": 228,
    "Л": 229,
    "П": 230,
    "Ф": 231,
    "Ц": 232,
    "б": 233,
    "в": 234,
    "г": 235,
    "д": 236,
    "з": 237,
    "и": 238,
    "й": 239,
    "к": 240,
    "л": 241,
    "м": 242,
    "н": 243,
    "п": 244,
    "р": 245,
    "с": 246,
    "т": 247,
    "у": 248,
    "ф": 249,
    "х": 250,
    "ц": 251,
    "ч": 252,
    "ш": 253,
    "щ": 254,
    "ы": 255,
    "ь": 256,
    "э": 257,
    "ю": 258,
    "я": 259,
    "ё": 260,
    "Ն": 261,
    "؊": 262,
    "؍": 263,
    "ٞ": 264,
    "ܨ": 265,
    "ࡆ": 266,
    "௦": 267,
    "௧": 268,
    "ᰔ": 269,
    "Ṇ": 270,
    "†": 271,
    "‡": 272,
    "•": 273,
    "‫": 274,
    "‬": 275,
    "′": 276,
    "‹": 277,
    "⁎": 278,
    "ℓ": 279,
    "™": 280,
    "Ⅲ": 281,
    "→": 282,
    "↓": 283,
    "↵": 284,
    "⇑": 285,
    "⇤": 286,
    "∆": 287,
    "∈": 288,
    "−": 289,
    "√": 290,
    "∞": 291,
    "∼": 292,
    "≃": 293,
    "≈": 294,
    "≤": 295,
    "≥": 296,
    "⊙": 297,
    "⋅": 298,
    "⋆": 299,
    "⌬": 300,
    "␣": 301,
    "␤": 302,
    "ⓒ": 303,
    "□": 304,
    "☯": 305,
    "♣": 306,
    "♦": 307,
    "✉": 308,
    "✝": 309,
    "⸸": 310,
    "ㆍ": 311,
    "": 312,
    "": 313,
    "": 314,
    "": 315,
    "": 316,
    "": 317,
    "": 318,
    "": 319,
    "": 320,
    "": 321,
    "": 322,
    "": 323,
    "": 324,
    "": 325,
    "": 326,
    "": 327,
    "，": 328,
    "；": 329,
    "�": 330
  },
  "tagVocab": {
    "<PAD>": 0,
    "B-<abstract>": 1,
    "B-<address>": 2,
    "B-<affiliation>": 3,
    "B-<author>": 4,
    "B-<availability>": 5,
    "B-<copyright>": 6,
    "B-<date>": 7,
    "B-<doctype>": 8,
    "B-<editor>": 9,
    "B-<email>": 10,
    "B-<funding>": 11,
    "B-<group>": 12,
    "B-<keyword>": 13,
    "B-<meeting>": 14,
    "B-<pubnum>": 15,
    "B-<reference>": 16,
    "B-<submission>": 17,
    "B-<title>": 18,
    "B-<web>": 19,
    "I-<abstract>": 20,
    "I-<address>": 21,
    "I-<affiliation>": 22,
    "I-<author>": 23,
    "I-<availability>": 24,
    "I-<copyright>": 25,
    "I-<date>": 26,
    "I-<doctype>": 27,
    "I-<editor>": 28,
    "I-<email>": 29,
    "I-<funding>": 30,
    "I-<group>": 31,
    "I-<keyword>": 32,
    "I-<meeting>": 33,
    "I-<pubnum>": 34,
    "I-<reference>": 35,
    "I-<submission>": 36,
    "I-<title>": 37,
    "I-<web>": 38,
    "O": 39
  },
  "tagIndex": {
    "0": "<PAD>",
    "1": "B-<abstract>",
    "2": "B-<address>",
    "3": "B-<affiliation>",
    "4": "B-<author>",
    "5": "B-<availability>",
    "6": "B-<copyright>",
    "7": "B-<date>",
    "8": "B-<doctype>",
    "9": "B-<editor>",
    "10": "B-<email>",
    "11": "B-<funding>",
    "12": "B-<group>",
    "13": "B-<keyword>",
    "14": "B-<meeting>",
    "15": "B-<pubnum>",
    "16": "B-<reference>",
    "17": "B-<submission>",
    "18": "B-<title>",
    "19": "B-<web>",
    "20": "I-<abstract>",
    "21": "I-<address>",
    "22": "I-<affiliation>",
    "23": "I-<author>",
    "24": "I-<availability>",
    "25": "I-<copyright>",
    "26": "I-<date>",
    "27": "I-<doctype>",
    "28": "I-<editor>",
    "29": "I-<email>",
    "30": "I-<funding>",
    "31": "I-<group>",
    "32": "I-<keyword>",
    "33": "I-<meeting>",
    "34": "I-<pubnum>",
    "35": "I-<reference>",
    "36": "I-<submission>",
    "37": "I-<title>",
    "38": "I-<web>",
    "39": "O"
  },
  "maxCharLength": 30,
  "featuresIndices": [
    9,
    10,
    11,
    12,
    13,
    14,
    15,
    16,
    17,
    18,
    19,
    20,
    21,
    22,
    23,
    24,
    25,
    26,
    27,
    28,
    29,
    30
  ],
  "featuresVocabularySize": 12,
  "featuresMapToIndex": {
    "9": {
      "BLOCKEND": 1,
      "BLOCKIN": 2,
      "BLOCKSTART": 3
    },
    "10": {
      "LINEEND": 13,
      "LINEIN": 14,
      "LINESTART": 15
    },
    "11": {
      "ALIGNEDLEFT": 25,
      "LINEINDENT": 26
    },
    "12": {
      "NEWFONT": 37,
      "SAMEFONT": 38
    },
    "13": {
      "HIGHERFONT": 49,
      "LOWERFONT": 50,
      "SAMEFONTSIZE": 51
    },
    "14": {
      "0": 61,
      "1": 62
    },
    "15": {
      "0": 73,
      "1": 74
    },
    "16": {
      "ALLCAP": 85,
      "INITCAP": 86,
      "NOCAPS": 87
    },
    "17": {
      "ALLDIGIT": 97,
      "CONTAINSDIGITS": 98,
      "NODIGIT": 99
    },
    "18": {
      "0": 109,
      "1": 110
    },
    "19": {
      "0": 121,
      "1": 122
    },
    "20": {
      "0": 133,
      "1": 134
    },
    "21": {
      "0": 145,
      "1": 146
    },
    "22": {
      "0": 157,
      "1": 158
    },
    "23": {
      "0": 169,
      "1": 170
    },
    "24": {
      "0": 181,
      "1": 182
    },
    "25": {
      "0": 193,
      "1": 194
    },
    "26": {
      "COMMA": 205,
      "DOT": 206,
      "ENDBRACKET": 207,
      "HYPHEN": 208,
      "NOPUNCT": 209,
      "OPENBRACKET": 210,
      "PUNCT": 211,
      "QUOTE": 212
    },
    "27": {
      "0": 217,
      "1": 218
    },
    "28": {
      "0": 229
    },
    "29": {
      "0": 241,
      "1": 242
    },
    "30": {
      "0": 253
    }
  }
}