{
  "charVocab": {
    "<PAD>": 0,
    "<UNK>": 1,
    "!": 2,
    "\"": 3,
    "#": 4,
    "$": 5,
    "%": 6,
    "&": 7,
    "'": 8,
    "(": 9,
    ")": 10,
    "*": 11,
    "+": 12,
    ",": 13,
    "-": 14,
    ".": 15,
    "/": 16,
    "0": 17,
    "1": 18,
    "2": 19,
    "3": 20,
    "4": 21,
    "5": 22,
    "6": 23,
    "7": 24,
    "8": 25,
    "9": 26,
    ":": 27,
    ";": 28,
    "<": 29,
    "=": 30,
    ">": 31,
    "?": 32,
    "@": 33,
    "A": 34,
    "B": 35,
    "C": 36,
    "D": 37,
    "E": 38,
    "F": 39,
    "G": 40,
    "H": 41,
    "I": 42,
    "J": 43,
    "K": 44,
    "L": 45,
    "M": 46,
    "N": 47,
    "O": 48,
    "P": 49,
    "Q": 50,
    "R": 51,
    "S": 52,
    "T": 53,
    "U": 54,
    "V": 55,
    "W": 56,
    "X": 57,
    "Y": 58,
    "Z": 59,
    "[": 60,
    "\\": 61,
    "]": 62,
    "^": 63,
    "_": 64,
    "`": 65,
    "a": 66,
    "b": 67,
    "c": 68,
    "d": 69,
    "e": 70,
    "f": 71,
    "g": 72,
    "h": 73,
    "i": 74,
    "j": 75,
    "k": 76,
    "l": 77,
    "m": 78,
    "n": 79,
    "o": 80,
    "p": 81,
    "q": 82,
    "r": 83,
    "s": 84,
    "t": 85,
    "u": 86,
    "v": 87,
    "w": 88,
    "x": 89,
    "y": 90,
    "z": 91,
    "{": 92,
    "|": 93,
    "}": 94,
    "~": 95,
    "¡": 96,
    "¢": 97,
    "£": 98,
    "¤": 99,
    "¥": 100,
    "§": 101,
    "¨": 102,
    "©": 103,
    "ª": 104,
    "«": 105,
    "®": 106,
    "¯": 107,
    "°": 108,
    "±": 109,
    "²": 110,
    "´": 111,
    "µ": 112,
    "¶": 113,
    "¸": 114,
    "»": 115,
    "¼": 116,
    "À": 117,
    "Á": 118,
    "Â": 119,
    "Ã": 120,
    "Å": 121,
    "Ç": 122,
    "É": 123,
    "Ê": 124,
    "Ì": 125,
    "Î": 126,
    "Ó": 127,
    "Õ": 128,
    "Ö": 129,
    "×": 130,
    "Ø": 131,
    "ß": 132,
    "à": 133,
    "á": 134,
    "â": 135,
    "ã": 136,
    "ä": 137,
    "å": 138,
    "ç": 139,
    "è": 140,
    "é": 141,
    "ê": 142,
    "ë": 143,
    "í": 144,
    "î": 145,
    "ï": 146,
    "ñ": 147,
    "ò": 148,
    "ó": 149,
    "ô": 150,
    "õ": 151,
    "ö": 152,
    "ø": 153,
    "ú": 154,
    "û": 155,
    "ü": 156,
    "ý": 157,
    "þ": 158,
    "ÿ": 159,
    "Ā": 160,
    "ă": 161,
    "Ą": 162,
    "Ć": 163,
    "ć": 164,
    "Č": 165,
    "č": 166,
    "ė": 167,
    "ę": 168,
    "ě": 169,
    "İ": 170,
    "ı": 171,
    "Ľ": 172,
    "ľ": 173,
    "Ł": 174,
    "ł": 175,
    "ń": 176,
    "ň": 177,
    "Ō": 178,
    "ř": 179,
    "ş": 180,
    "Š": 181,
    "š": 182,
    "Ź": 183,
    "ź": 184,
    "ż": 185,
    "Ž": 186,
    "ž": 187,
    "Ȃ": 188,
    "ʈ": 189,
    "ˆ": 190,
    "˙": 191,
    "͑": 192,
    "͒": 193,
    "͓": 194,
    "͔": 195,
    "͗": 196,
    "͘": 197,
    "Γ": 198,
    "Δ": 199,
    "Θ": 200,
    "Λ": 201,
    "Ξ": 202,
    "Π": 203,
    "Σ": 204,
    "Υ": 205,
    "Φ": 206,
    "Ψ": 207,
    "α": 208,
    "β": 209,
    "γ": 210,
    "δ": 211,
    "ε": 212,
    "ζ": 213,
    "η": 214,
    "θ": 215,
    "κ": 216,
    "λ": 217,
    "μ": 218,
    "ν": 219,
    "ξ": 220,
    "π": 221,
    "ρ": 222,
    "σ": 223,
    "τ": 224,
    "φ": 225,
    "χ": 226,
    "ψ": 227,
    "ω": 228,
    "ϕ": 229,
    "ϩ": 230,
    "Ϫ": 231,
    "ϫ": 232,
    "ϭ": 233,
    "ϳ": 234,
    "Ͻ": 235,
    "Ͼ": 236,
    "Ј": 237,
    "Љ": 238,
    "Б": 239,
    "И": 240,
    "Л": 241,
    "П": 242,
    "Ф": 243,
    "Ц": 244,
    "б": 245,
    "в": 246,
    "г": 247,
    "д": 248,
    "з": 249,
    "и": 250,
    "й": 251,
    "к": 252,
    "л": 253,
    "м": 254,
    "н": 255,
    "п": 256,
    "р": 257,
    "с": 258,
    "т": 259,
    "у": 260,
    "ф": 261,
    "х": 262,
    "ц": 263,
    "ч": 264,
    "ш": 265,
    "щ": 266,
    "ы": 267,
    "ь": 268,
    "э": 269,
    "ю": 270,
    "я": 271,
    "ё": 272,
    "Ն": 273,
    "؊": 274,
    "؍": 275,
    "ٞ": 276,
    "ܨ": 277,
    "ࡆ": 278,
    "௦": 279,
    "௧": 280,
    "ᰔ": 281,
    "Ṇ": 282,
    "†": 283,
    "‡": 284,
    "•": 285,
    "‫": 286,
    "‬": 287,
    "′": 288,
    "‹": 289,
    "⁎": 290,
    "ℓ": 291,
    "™": 292,
    "Ⅲ": 293,
    "→": 294,
    "↓": 295,
    "↵": 296,
    "⇑": 297,
    "⇤": 298,
    "∆": 299,
    "∈": 300,
    "−": 301,
    "∓": 302,
    "√": 303,
    "∞": 304,
    "∼": 305,
    "≃": 306,
    "≈": 307,
    "≤": 308,
    "≥": 309,
    "⊙": 310,
    "⋅": 311,
    "⋆": 312,
    "⌬": 313,
    "␣": 314,
    "␤": 315,
    "ⓒ": 316,
    "□": 317,
    "☯": 318,
    "♣": 319,
    "♦": 320,
    "✉": 321,
    "✝": 322,
    "⸸": 323,
    "ㆍ": 324,
    "": 325,
    "": 326,
    "": 327,
    "": 328,
    "": 329,
    "": 330,
    "": 331,
    "": 332,
    "": 333,
    "": 334,
    "": 335,
    "": 336,
    "": 337,
    "": 338,
    "": 339,
    "": 340,
    "": 341,
    "": 342,
    "，": 343,
    "；": 344,
    "�": 345
  },
  "tagVocab": {
    "<PAD>": 0,
    "B-<abstract>": 1,
    "B-<address>": 2,
    "B-<affiliation>": 3,
    "B-<author>": 4,
    "B-<availability>": 5,
    "B-<conflict>": 6,
    "B-<contribution>": 7,
    "B-<copyright>": 8,
    "B-<date>": 9,
    "B-<doctype>": 10,
    "B-<editor>": 11,
    "B-<email>": 12,
    "B-<funding>": 13,
    "B-<group>": 14,
    "B-<keyword>": 15,
    "B-<meeting>": 16,
    "B-<pubnum>": 17,
    "B-<reference>": 18,
    "B-<submission>": 19,
    "B-<title>": 20,
    "B-<web>": 21,
    "I-<abstract>": 22,
    "I-<address>": 23,
    "I-<affiliation>": 24,
    "I-<author>": 25,
    "I-<availability>": 26,
    "I-<conflict>": 27,
    "I-<contribution>": 28,
    "I-<copyright>": 29,
    "I-<date>": 30,
    "I-<doctype>": 31,
    "I-<editor>": 32,
    "I-<email>": 33,
    "I-<funding>": 34,
    "I-<group>": 35,
    "I-<keyword>": 36,
    "I-<meeting>": 37,
    "I-<pubnum>": 38,
    "I-<reference>": 39,
    "I-<submission>": 40,
    "I-<title>": 41,
    "I-<web>": 42,
    "O": 43
  },
  "tagIndex": {
    "0": "<PAD>",
    "1": "B-<abstract>",
    "2": "B-<address>",
    "3": "B-<affiliation>",
    "4": "B-<author>",
    "5": "B-<availability>",
    "6": "B-<conflict>",
    "7": "B-<contribution>",
    "8": "B-<copyright>",
    "9": "B-<date>",
    "10": "B-<doctype>",
    "11": "B-<editor>",
    "12": "B-<email>",
    "13": "B-<funding>",
    "14": "B-<group>",
    "15": "B-<keyword>",
    "16": "B-<meeting>",
    "17": "B-<pubnum>",
    "18": "B-<reference>",
    "19": "B-<submission>",
    "20": "B-<title>",
    "21": "B-<web>",
    "22": "I-<abstract>",
    "23": "I-<address>",
    "24": "I-<affiliation>",
    "25": "I-<author>",
    "26": "I-<availability>",
    "27": "I-<conflict>",
    "28": "I-<contribution>",
    "29": "I-<copyright>",
    "30": "I-<date>",
    "31": "I-<doctype>",
    "32": "I-<editor>",
    "33": "I-<email>",
    "34": "I-<funding>",
    "35": "I-<group>",
    "36": "I-<keyword>",
    "37": "I-<meeting>",
    "38": "I-<pubnum>",
    "39": "I-<reference>",
    "40": "I-<submission>",
    "41": "I-<title>",
    "42": "I-<web>",
    "43": "O"
  },
  "maxCharLength": 30,
  "featuresIndices": [
    9,
    10,
    11,
    12,
    13,
    14,
    15,
    16,
    17,
    18,
    19,
    20,
    21,
    22,
    23,
    24,
    25,
    26,
    27,
    28,
    29,
    30
  ],
  "featuresVocabularySize": 12,
  "featuresMapToIndex": {
    "9": {
      "BLOCKEND": 1,
      "BLOCKIN": 2,
      "BLOCKSTART": 3
    },
    "10": {
      "LINEEND": 13,
      "LINEIN": 14,
      "LINESTART": 15
    },
    "11": {
      "ALIGNEDLEFT": 25,
      "LINEINDENT": 26
    },
    "12": {
      "NEWFONT": 37,
      "SAMEFONT": 38
    },
    "13": {
      "HIGHERFONT": 49,
      "LOWERFONT": 50,
      "SAMEFONTSIZE": 51
    },
    "14": {
      "0": 61,
      "1": 62
    },
    "15": {
      "0": 73,
      "1": 74
    },
    "16": {
      "ALLCAP": 85,
      "INITCAP": 86,
      "NOCAPS": 87
    },
    "17": {
      "ALLDIGIT": 97,
      "CONTAINSDIGITS": 98,
      "NODIGIT": 99
    },
    "18": {
      "0": 109,
      "1": 110
    },
    "19": {
      "0": 121,
      "1": 122
    },
    "20": {
      "0": 133,
      "1": 134
    },
    "21": {
      "0": 145,
      "1": 146
    },
    "22": {
      "0": 157,
      "1": 158
    },
    "23": {
      "0": 169,
      "1": 170
    },
    "24": {
      "0": 181,
      "1": 182
    },
    "25": {
      "0": 193,
      "1": 194
    },
    "26": {
      "COMMA": 205,
      "DOT": 206,
      "ENDBRACKET": 207,
      "HYPHEN": 208,
      "NOPUNCT": 209,
      "OPENBRACKET": 210,
      "PUNCT": 211,
      "QUOTE": 212
    },
    "27": {
      "0": 217,
      "1": 218
    },
    "28": {
      "0": 229
    },
    "29": {
      "0": 241,
      "1": 242
    },
    "30": {
      "0": 253
    }
  }
}