{
  "charVocab": {
    "<PAD>": 0,
    "<UNK>": 1,
    "\"": 2,
    "#": 3,
    "%": 4,
    "&": 5,
    "'": 6,
    "(": 7,
    ")": 8,
    "*": 9,
    "+": 10,
    ",": 11,
    "-": 12,
    ".": 13,
    "/": 14,
    "0": 15,
    "1": 16,
    "2": 17,
    "3": 18,
    "4": 19,
    "5": 20,
    "6": 21,
    "7": 22,
    "8": 23,
    "9": 24,
    ":": 25,
    ";": 26,
    "<": 27,
    "=": 28,
    ">": 29,
    "@": 30,
    "A": 31,
    "B": 32,
    "C": 33,
    "D": 34,
    "E": 35,
    "F": 36,
    "G": 37,
    "H": 38,
    "I": 39,
    "J": 40,
    "K": 41,
    "L": 42,
    "M": 43,
    "N": 44,
    "O": 45,
    "P": 46,
    "Q": 47,
    "R": 48,
    "S": 49,
    "T": 50,
    "U": 51,
    "V": 52,
    "W": 53,
    "X": 54,
    "Y": 55,
    "Z": 56,
    "[": 57,
    "\\": 58,
    "]": 59,
    "_": 60,
    "`": 61,
    "a": 62,
    "b": 63,
    "c": 64,
    "d": 65,
    "e": 66,
    "f": 67,
    "g": 68,
    "h": 69,
    "i": 70,
    "j": 71,
    "k": 72,
    "l": 73,
    "m": 74,
    "n": 75,
    "o": 76,
    "p": 77,
    "q": 78,
    "r": 79,
    "s": 80,
    "t": 81,
    "u": 82,
    "v": 83,
    "w": 84,
    "x": 85,
    "y": 86,
    "z": 87,
    "{": 88,
    "£": 89,
    "¨": 90,
    "«": 91,
    "®": 92,
    "°": 93,
    "´": 94,
    "µ": 95,
    "¸": 96,
    "»": 97,
    "Ç": 98,
    "É": 99,
    "Î": 100,
    "Ö": 101,
    "Ø": 102,
    "ß": 103,
    "à": 104,
    "á": 105,
    "â": 106,
    "ã": 107,
    "ä": 108,
    "å": 109,
    "ç": 110,
    "è": 111,
    "é": 112,
    "ê": 113,
    "ë": 114,
    "í": 115,
    "î": 116,
    "ñ": 117,
    "ò": 118,
    "ó": 119,
    "ô": 120,
    "õ": 121,
    "ö": 122,
    "ø": 123,
    "ú": 124,
    "ü": 125,
    "ā": 126,
    "ą": 127,
    "ć": 128,
    "ě": 129,
    "ğ": 130,
    "ı": 131,
    "ł": 132,
    "ř": 133,
    "ş": 134,
    "ů": 135,
    "ȩ": 136,
    "β": 137,
    "γ": 138,
    "а": 139,
    "ṍ": 140,
    "’": 141,
    "“": 142,
    "”": 143,
    "†": 144,
    "€": 145,
    "№": 146,
    "□": 147
  },
  "tagVocab": {
    "<PAD>": 0,
    "B-<affiliation>": 1,
    "B-<funderName>": 2,
    "B-<grantName>": 3,
    "B-<grantNumber>": 4,
    "B-<institution>": 5,
    "B-<person>": 6,
    "B-<programName>": 7,
    "B-<projectName>": 8,
    "I-<affiliation>": 9,
    "I-<funderName>": 10,
    "I-<grantName>": 11,
    "I-<grantNumber>": 12,
    "I-<institution>": 13,
    "I-<person>": 14,
    "I-<programName>": 15,
    "I-<projectName>": 16,
    "O": 17
  },
  "tagIndex": {
    "0": "<PAD>",
    "1": "B-<affiliation>",
    "2": "B-<funderName>",
    "3": "B-<grantName>",
    "4": "B-<grantNumber>",
    "5": "B-<institution>",
    "6": "B-<person>",
    "7": "B-<programName>",
    "8": "B-<projectName>",
    "9": "I-<affiliation>",
    "10": "I-<funderName>",
    "11": "I-<grantName>",
    "12": "I-<grantNumber>",
    "13": "I-<institution>",
    "14": "I-<person>",
    "15": "I-<programName>",
    "16": "I-<projectName>",
    "17": "O"
  },
  "maxCharLength": 30,
  "featuresIndices": [
    9,
    10,
    11,
    12,
    13,
    14
  ],
  "featuresVocabularySize": 12,
  "featuresMapToIndex": {
    "9": {
      "LINEEND": 1,
      "LINEIN": 2,
      "LINESTART": 3
    },
    "10": {
      "ALLCAP": 13,
      "INITCAP": 14,
      "NOCAPS": 15
    },
    "11": {
      "ALLDIGIT": 25,
      "CONTAINSDIGITS": 26,
      "NODIGIT": 27
    },
    "12": {
      "0": 37,
      "1": 38
    },
    "13": {
      "0": 49,
      "1": 50
    },
    "14": {
      "COMMA": 61,
      "DOT": 62,
      "ENDBRACKET": 63,
      "HYPHEN": 64,
      "NOPUNCT": 65,
      "OPENBRACKET": 66,
      "PUNCT": 67,
      "QUOTE": 68
    }
  }
}