{
  "charVocab": {
    "<PAD>": 0,
    "<UNK>": 1,
    "!": 2,
    "\"": 3,
    "#": 4,
    "%": 5,
    "&": 6,
    "'": 7,
    "(": 8,
    ")": 9,
    "*": 10,
    "+": 11,
    ",": 12,
    "-": 13,
    ".": 14,
    "/": 15,
    "0": 16,
    "1": 17,
    "2": 18,
    "3": 19,
    "4": 20,
    "5": 21,
    "6": 22,
    "7": 23,
    "8": 24,
    "9": 25,
    ":": 26,
    ";": 27,
    "<": 28,
    "=": 29,
    ">": 30,
    "?": 31,
    "@": 32,
    "A": 33,
    "B": 34,
    "C": 35,
    "D": 36,
    "E": 37,
    "F": 38,
    "G": 39,
    "H": 40,
    "I": 41,
    "J": 42,
    "K": 43,
    "L": 44,
    "M": 45,
    "N": 46,
    "O": 47,
    "P": 48,
    "Q": 49,
    "R": 50,
    "S": 51,
    "T": 52,
    "U": 53,
    "V": 54,
    "W": 55,
    "X": 56,
    "Y": 57,
    "Z": 58,
    "[": 59,
    "]": 60,
    "_": 61,
    "`": 62,
    "a": 63,
    "b": 64,
    "c": 65,
    "d": 66,
    "e": 67,
    "f": 68,
    "g": 69,
    "h": 70,
    "i": 71,
    "j": 72,
    "k": 73,
    "l": 74,
    "m": 75,
    "n": 76,
    "o": 77,
    "p": 78,
    "q": 79,
    "r": 80,
    "s": 81,
    "t": 82,
    "u": 83,
    "v": 84,
    "w": 85,
    "x": 86,
    "y": 87,
    "z": 88,
    "{": 89,
    "|": 90,
    "}": 91,
    "~": 92,
    "¨": 93,
    "±": 94,
    "´": 95,
    "¸": 96,
    "Á": 97,
    "Ã": 98,
    "É": 99,
    "Ö": 100,
    "×": 101,
    "Ø": 102,
    "ß": 103,
    "à": 104,
    "á": 105,
    "â": 106,
    "ã": 107,
    "ä": 108,
    "å": 109,
    "ç": 110,
    "è": 111,
    "é": 112,
    "ê": 113,
    "ì": 114,
    "í": 115,
    "î": 116,
    "ñ": 117,
    "ò": 118,
    "ó": 119,
    "ô": 120,
    "ö": 121,
    "ø": 122,
    "ú": 123,
    "ü": 124,
    "ý": 125,
    "ÿ": 126,
    "Ă": 127,
    "ć": 128,
    "č": 129,
    "ğ": 130,
    "İ": 131,
    "ı": 132,
    "Ĳ": 133,
    "ľ": 134,
    "ł": 135,
    "ń": 136,
    "ň": 137,
    "ř": 138,
    "ş": 139,
    "š": 140,
    "ů": 141,
    "Ź": 142,
    "ž": 143,
    "ˆ": 144,
    "˜": 145,
    "Λ": 146,
    "β": 147,
    "γ": 148,
    "π": 149,
    "σ": 150,
    "φ": 151,
    "ϩ": 152,
    "Ϫ": 153,
    "ϫ": 154,
    "ϳ": 155,
    "Ј": 156,
    "–": 157,
    "—": 158,
    "†": 159,
    "•": 160,
    "…": 161,
    "→": 162,
    "∆": 163,
    "−": 164,
    "∞": 165,
    "∼": 166,
    "≅": 167,
    "␣": 168,
    "␤": 169,
    "": 170,
    "": 171
  },
  "tagVocab": {
    "<PAD>": 0,
    "B-<label>": 1,
    "B-<reference>": 2,
    "I-<label>": 3,
    "I-<reference>": 4,
    "O": 5
  },
  "tagIndex": {
    "0": "<PAD>",
    "1": "B-<label>",
    "2": "B-<reference>",
    "3": "I-<label>",
    "4": "I-<reference>",
    "5": "O"
  },
  "maxCharLength": 30,
  "featuresIndices": [
    9,
    10,
    11,
    12,
    13,
    14,
    15,
    16,
    17,
    18,
    19,
    20,
    21,
    22,
    23,
    24,
    25,
    26
  ],
  "featuresVocabularySize": 12,
  "featuresMapToIndex": {
    "9": {
      "LINEEND": 1,
      "LINEIN": 2,
      "LINESTART": 3
    },
    "10": {
      "ALIGNEDLEFT": 13,
      "LINEINDENT": 14
    },
    "11": {
      "ALLCAP": 25,
      "INITCAP": 26,
      "NOCAPS": 27
    },
    "12": {
      "ALLDIGIT": 37,
      "CONTAINSDIGITS": 38,
      "NODIGIT": 39
    },
    "13": {
      "0": 49,
      "1": 50
    },
    "14": {
      "0": 61,
      "1": 62
    },
    "15": {
      "0": 73,
      "1": 74
    },
    "16": {
      "0": 85
    },
    "17": {
      "0": 97
    },
    "18": {
      "0": 109,
      "1": 110
    },
    "19": {
      "0": 121,
      "1": 122
    },
    "20": {
      "0": 133,
      "1": 134
    },
    "21": {
      "COMMA": 145,
      "DOT": 146,
      "ENDBRACKET": 147,
      "HYPHEN": 148,
      "NOPUNCT": 149,
      "OPENBRACKET": 150,
      "PUNCT": 151,
      "QUOTE": 152
    },
    "22": {
      "0": 157,
      "1": 158,
      "10": 159,
      "2": 160,
      "3": 161,
      "4": 162,
      "5": 163,
      "6": 164,
      "7": 165,
      "8": 166,
      "9": 167
    },
    "23": {
      "0": 169,
      "1": 170,
      "10": 171,
      "2": 172,
      "3": 173,
      "4": 174,
      "5": 175,
      "6": 176,
      "7": 177,
      "8": 178,
      "9": 179
    },
    "24": {
      "BLOCKEND": 181,
      "BLOCKIN": 182,
      "BLOCKSTART": 183
    },
    "25": {
      "1": 193,
      "10": 194,
      "2": 195,
      "3": 196,
      "4": 197,
      "5": 198,
      "6": 199,
      "7": 200,
      "8": 201,
      "9": 202,
      "no": 203
    },
    "26": {
      "0": 205
    }
  }
}